tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
brew "asdf"
brew "bash"
brew "bats"
brew "blueutil"
brew "coreutils"
brew "csvkit"
brew "curl"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fish"
brew "fontconfig"
brew "fswatch"
brew "gawk"
brew "gettext"
brew "gist"
brew "git"
brew "git-secret"
brew "glib"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnuplot"
brew "gnutls"
brew "gpgme"
brew "guile"
brew "hopenpgp-tools"
brew "hostess"
brew "httpie"
brew "hub"
brew "icu4c"
brew "imagemagick"
brew "jq"
brew "libevent"
brew "mas"
brew "moreutils"
brew "ncurses"
brew "ocrmypdf"
brew "openssl"
brew "openssl@1.1"
brew "pandoc"
brew "pango"
brew "paperkey"
brew "pdftk-java"
brew "pinentry-mac"
brew "pkg-config"
brew "qrencode"
brew "reattach-to-user-namespace"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "switchaudio-osx"
brew "the_silver_searcher"
brew "thefuck"
brew "thoughtbot/formulae/rcm"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "ykman"
cask "alfred"
cask "amethyst"
cask "anki"
cask "bartender"
cask "basictex"
cask "calibre"
cask "dash"
cask "google-chrome"
cask "gpg-suite"
cask "hazel"
cask "istat-menus"
cask "keepassxc"
cask "keeweb"
cask "kitty"
cask "macvim"
cask "plover"
cask "shortcat"
cask "sonos"
cask "vagrant"
cask "virtualbox"
mas "1Password 7", id: 1333542190
mas "DaisyDisk", id: 411643860
mas "Gemini 2", id: 1090488118
mas "iA Writer", id: 775737590
mas "Kindle", id: 405399194
mas "Meeter", id: 1510445899
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Shush", id: 496437906
mas "Soulver", id: 413965349
mas "Strongbox", id: 1270075435
mas "TableFlip", id: 1462643128
mas "TaskPaper", id: 1090940630
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WireGuard", id: 1451685025
mas "xScope", id: 889428659
