tap "bramstein/webfonttools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Parser generator
brew "bison"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Command-line interface for SQLite
brew "sqlite"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Manage compile and link flags for libraries
brew "pkg-config"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Command-driven, interactive function plotting
brew "gnuplot"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Your Swiss Army Knife for Protocol Buffers
brew "prototool"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Source-code syntax highlighter
brew "source-highlight"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "basictex"
cask "google-cloud-sdk"
mas "1Password 7", id: 1333542190
mas "Apple Configurator 2", id: 1037126344
mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "LittleIpsum", id: 405772121
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899
mas "MultiMarkdown Composer", id: 1275176220
mas "Pixelmator", id: 407963104
mas "Shush", id: 496437906
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "TaskPaper", id: 1090940630
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WireGuard", id: 1451685025
mas "xScope", id: 889428659
