tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
cask "adoptopenjdk8"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Text processing scripting language
brew "awk"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed search & analytics engine
brew "elasticsearch"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Like cURL, but for gRPC
brew "grpcurl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Port scanning utility for large networks
brew "nmap"
# SSL/TLS cryptography library
brew "openssl"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Your Swiss Army Knife for Protocol Buffers
brew "prototool"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "basictex"
cask "google-cloud-sdk"
cask "minikube"
cask "vagrant"
cask "virtualbox"
mas "1Password 7", id: 1333542190
mas "Helium", id: 1054607607
mas "iA Writer", id: 775737590
mas "LastPass", id: 926036361
mas "LittleIpsum", id: 405772121
mas "Magnet", id: 441258766
mas "MultiMarkdown Composer", id: 1275176220
mas "PCalc", id: 403504866
mas "Pixelmator", id: 407963104
mas "Shush", id: 496437906
mas "TaskPaper", id: 1090940630
mas "The Unarchiver", id: 425424353
mas "xScope", id: 889428659
