tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "thoughtbot/formulae"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Text processing scripting language
brew "awk"
# Pack, ship and run any application as a lightweight container
brew "docker"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Command-line utility for uploading Gists
brew "gist"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "vagrant"
cask "virtualbox"
mas "com.acqualia.soulver", id: 413965349
mas "com.agilebits.onepassword-osx", id: 443987910
mas "com.agilebits.onepassword7", id: 1333542190
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.boinx.Mousepose.Mac", id: 405904955
mas "com.catpigstudios.Radium3", id: 597611879
mas "com.crowdcafe.windowmagnet", id: 441258766
mas "com.culturedcode.ThingsMac", id: 904280696
mas "com.dustinsenos.littleipsum", id: 405772121
mas "com.flexibits.fantastical2.mac", id: 975937182
mas "com.hogbaysoftware.TaskPaper3", id: 1090940630
mas "com.iconfactory.mac.xScope", id: 889428659
mas "com.JadenGeller.Helium", id: 1054607607
mas "com.lastpass.LastPass", id: 926036361
mas "com.mizage.shush", id: 496437906
mas "com.pixelmatorteam.pixelmator", id: 407963104
mas "com.tinyspeck.slackmacgap", id: 803453959
mas "cx.c3.theunarchiver", id: 425424353
mas "pro.writer.mac", id: 775737590
mas "uk.co.tla-systems.pcalc", id: 403504866
